In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
from sklearn.linear_model import LinearRegression
%matplotlib inline

In [21]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
df1 = df.drop(["PassengerId", "SibSp", "Parch", "Cabin","Ticket","Name","Embarked"], axis = 1)
df1.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [23]:
from sklearn.preprocessing import LabelEncoder

In [24]:
le_sex = LabelEncoder()

In [25]:
df1['SEX'] = le_sex.fit_transform(df1["Sex"])
df1.head()

   Survived  Pclass     Sex   Age     Fare  SEX
0         0       3    male  22.0   7.2500    1
1         1       1  female  38.0  71.2833    0
2         1       3  female  26.0   7.9250    0
3         1       1  female  35.0  53.1000    0
4         0       3    male  35.0   8.0500    1

In [26]:
df1.drop("Sex",axis = 1,inplace = True)
df1.head()

   Survived  Pclass   Age     Fare  SEX
0         0       3  22.0   7.2500    1
1         1       1  38.0  71.2833    0
2         1       3  26.0   7.9250    0
3         1       1  35.0  53.1000    0
4         0       3  35.0   8.0500    1

In [27]:
df1.isnull().sum()

Survived      0
Pclass        0
Age         177
Fare          0
SEX           0
dtype: int64

In [28]:
df1.shape

(891, 5)

In [29]:
df1['Age'].fillna(df['Age'].mean(),inplace=True)
df1.isnull().any()

Survived    False
Pclass      False
Age         False
Fare        False
SEX         False
dtype: bool

In [30]:
X = df1.drop('Survived',axis = 1)
Y = df1['Survived']

In [31]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

In [32]:
model = DecisionTreeClassifier()

In [33]:
X_train, X_test, Y_train, Y_test = train_test_split(X,Y,train_size = 0.9)

In [34]:
model.fit(X_train,Y_train)

DecisionTreeClassifier()

In [36]:
model.score(X_test,Y_test)

0.8